{"posts":[{"title":"NLP","text":"We also have other languages:简体中文。","link":"/2022/09/08/en/NLP01/"},{"title":"A short brief of Transformer","text":"We also have other languages:简体中文。","link":"/2022/09/09/en/Transformer/"},{"title":"welcome to my space","text":"We also have other languages:简体中文。 This is my blog. I think that I will write a lot of things in the future. It mainly about some my experience in computer learning. It may have many fields because I like share my experience in all fields. All in all, this blog’s content will be various. But it mostly will be the experience for my in a period of time. Is there any about my life? Probably have. Most my blog will write both in English and Chinese. If I learn Japanese well in the future, maybe I will write in three different languages. Who knows. I will add tag in every post in order to help you look up conveniently.","link":"/2022/09/08/en/welcome/"},{"title":"自然语言处理","text":"本文同时提供以下语言的翻译：English。","link":"/2022/10/06/zh-CN/NLP01/"},{"title":"Transformer概述","text":"本文同时提供以下语言的翻译：English。 TransformerTransformer是近些年一个比较火的机器学习模型，诞生于Google的机器翻译团队，原始论文为《Attention is All You Need》 什么是TransformerTransformer其实从名字上可以看出来，该模型脱胎自一个翻译（Translate）应用，原始论文的标题其实也可以告诉我们，Transformer主要是依靠Attention机制。Transformer由于是NLP领域的模型，其主要是处理类似句子这种在前后维度（也就是两个词或多个词）上具有相关性的数据，也就是回归问题。但是由于其采用的Attention机制可以大大拓宽感受野，近来也在分类问题上能有一定的成就（例如CV领域，情感分析领域）。 Transformer怎么构成对于Transformer本身的结构，甚至可以说比之前很多的NLP领域的模型要简洁易用的多，主要是由Encoder和Decoder两部分组成（如下图） Transformer的优势Transformer的机制Transformer的应用代码由于个人平时写pytorch，所以这里大部分代码都是基于pytorch的Python代码。 基于Transformer在时序预测领域的使用模型的jupyter文件链接：https://colab.research.google.com/drive/1yG01IFE8tJU_E59iqEL0t2iFRyLaaTYA?usp=sharing 这个模型虽然不是标准的Transformer，但是采用了ConvTrans的模型，整体上是在Transformer的位置编码的时候增加了一个卷积层，具体实现我们将会在后面的博客讲解。 我这里实现的是利用Transformer将一段时间内（30天）的中国大陆几个城市（深圳，上海，北京，长春）的疫情数据进行预测，训练30天的数据，测试集为30-42天的疫情数据，输入12天的疫情数据，输出第13天的疫情数据，从而进行训练，并以此进行简单迁移，从而观测是否因此可以判断一个城市的防疫政策的好坏。由于数据量不足以及单纯进行简单迁移，同时考虑的维度过于简单，只能作为一个小的预测实验，效果一般。","link":"/2022/10/18/zh-CN/Transformer/"},{"title":"Python安装与配置","text":"test","link":"/2022/09/08/zh-CN/python_setup/"},{"title":"欢迎来到开心的小窝","text":"本文同时提供以下语言的翻译：English。 这是开心的一个博客，目前来说可能会写很多方面的东西，主要是自己平时的心得体会，包括一些开发心得。方向可能是五花八门，毕竟我也属于想到什么写什么。 总而言之，虽然博客的内容可能各种各样，但是整体上是我一段时间的学习心得和经验总结，有没有可能有生活上呢，应该是有的。大部分的博客我都尽可能撰写中英双语，当然如果我后期日语学的也比较好就可能变成三语，谁知道呢。 至于博客我都打上tag，这样也方便大家进行查阅。","link":"/2022/09/08/zh-CN/welcome/"}],"tags":[{"name":"NLP","slug":"NLP","link":"/tags/NLP/"},{"name":"welcome","slug":"welcome","link":"/tags/welcome/"},{"name":"Python","slug":"Python","link":"/tags/Python/"},{"name":"欢迎","slug":"欢迎","link":"/tags/%E6%AC%A2%E8%BF%8E/"}],"categories":[],"pages":[{"title":"","text":"关于本站本站基于hexo和主题icarus实现，具体内容主要是平时在开发过程中遇到的问题与解决方法，或者简单写一点编程心得和个人平时的经历与感想。希望这个站点可以成为一个查询文档用的一个宝库。我会尽可能的将文档写成中英两份，但是个人感想一般不会翻译。 关于我这个部分我可能会不定期更新，所以每一次可能都会新内容？ 自我介绍目前是一名大四计算机在读学生，属于多面手的属性，计算机相关领域都有所了解，目前可以熟练使用的语言有Java， Cpp， Golang， Python，Vue（前端框架）等能独立实现全栈开发的全套业务。对于其他领域我也会有所涉猎，深度学习和计算机安全领域具有一定的了解。我对一切新知识与计算机科学充满了兴趣与热爱，希望在自己倒下之前可以为自己热爱的领域贡献自己的力量。 属于MTF（已经含糖），异性恋，喜欢文静安静的男孩子，生活喜欢一个人思考与一个人独处，有较强控制欲 （所以想当我男朋友应该先考虑一下能不能受得了天天被我骚扰哦） ，属于有比较明显的RSD症状，性格耿直，对错误的观点容易不考虑对方情感而指出，追求真理与科学，马列毛主义信仰者，热爱开源事业，热爱分享知识，愿望是希望人类可以早日实现机械飞升。想和我取得联系的可以点击左侧的telegram和我交流。 我的特殊技能语言能力中文（母语）简体中文 英文（较好）English 日语（初学）日本語 程序设计能力前端开发（一般） 后端开发（熟悉） 深度学习模型编写（入门） 程序安全（入门） 移动端应用开发（一般） unity游戏开发（入门） 杂七杂八（入门水平）Photoshop使用设计 finalcutpro/premiere基本使用 微信公众号推送布局与排版 latex/markdown 编写 红色警戒/即时战略游戏","link":"/about/index.html"}]}